Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/lora_app.c
  /* EnvSensors_Read(&sensor_data);
#if defined (SENSOR_ENABLED) && (SENSOR_ENABLED == 1)
  temperature = (int16_t) sensor_data.temperature;
#else
  temperature = (SYS_GetTemperatureLevel() >> 8);
#endif  /* SENSOR_ENABLED */
  /*  pressure    = (uint16_t)(sensor_data.pressure * 100 / 10);      /* in hPa / 10 */

    AppData.Port = LORAWAN_USER_APP_PORT;

   /*#ifdef CAYENNE_LPP
  CayenneLppReset();
  CayenneLppAddBarometricPressure(channel++, pressure);
  CayenneLppAddTemperature(channel++, temperature);
  CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity));

  if ((LmHandlerParams.ActiveRegion != LORAMAC_REGION_US915) && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AU915)
      && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AS923))
  {
    CayenneLppAddDigitalInput(channel++, GetBatteryLevel());
    CayenneLppAddDigitalOutput(channel++, AppLedStateOn);
  }

  CayenneLppCopy(AppData.Buffer);
  AppData.BufferSize = CayenneLppGetSize();
#else  /* not CAYENNE_LPP */
    /* humidity    = (uint16_t)(sensor_data.humidity * 10);            /* in %*10     */

  AppData.Buffer[i++] = AppLedStateOn;
  /*  AppData.Buffer[i++] = (uint8_t)((pressure >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(pressure & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);
  */
  //AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  // payload == "text";
  // AppData.Buffer[i++] = payload;
  // BMP280_HandleTypedef bmp280;
  // LmHandlerGetDevAddr = i;
// HAL_I2C_GetState(&hi2c1);
 // HAL_I2C_Master_Receive(&bmp280);
	 // I2C_DMAMasterReceiveCplt(DMA_HandleTypeDef *hdma)
		//HAL_I2C_GetState;
  // __B_L072Z_LRWAN1_BSP_VERSION_MAIN = i;
  // bmp280_init_default_params(&bmp280.params);
  //  bmp280.addr = BMP280_I2C_ADDRESS_0;

  // bmp280.i2c = &hi2c1;
   // bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
  //  bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
  bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
  // bool bme280p = bmp280.id == BME280_CHIP_ID;
  size = (temperature1, pressure1, humidity1);

  // HAL_I2C_Master_Receive(&hi2c1, size);
  //  bmp280_read_float(&bme280p, &temperature1, &pressure1, &humidity1);
    //dev
 // LmHandlerAppData_t *appData, LmHandlerRxParams_t *params):
  // for i = setbuf(AppData.Buffer, 51);
  // AppData.Buffer[i++] = temperature1;// 1  варик
  // AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
  // AppData.Buffer[i++] = 0x02;
  // for (i = 0; i <= 50; i++)  ||Cчётчик
  // pressure1 = (uint16_t)(params.oversampling_pressure * 10);

    //    AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // humidity1 = (uint16_t)(bmp280_params_t).oversampling_humidity * 10;
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // pressure1 = (uint16_t)(params.oversampling_pressure * 10);
    //temperature1 = (uint16_t)(params.oversampling_temperature * 10);
  // temperature1 = 0x02;
  // AppData.Buffer[i++] = (uint16_t)pressure1 >> 1 ;
  // AppData.Buffer[i++] = (uint8_t)temperature1 >> 8 ;
  //  AppData.Buffer[i++] = (int)humidity1 >> 16;

  AppData.Buffer[i++] = 0x02;
  AppData.Buffer[i++] = pressure1;
  AppData.Buffer[i++] = temperature1;
  AppData.Buffer[i++] = size;
  //   AppData.Buffer[i] = temperature1;
   // AppData.Buffer[i] = Snr;
  // AppData.Buffer[i++] = 0x02;
  // AppData.Buffer[i++] = 0x02;
  // AppData.Buffer[i++] = 0x02;
  /* */
  // AppData.Buffer[i] = i;  ||Cчётчик

  // AppData.Buffer[i++] = '\0';




 // AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
 // AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);

	  /*   if ((LmHandlerParams.ActiveRegion == LORAMAC_REGION_US915) || (LmHandlerParams.ActiveRegion == LORAMAC_REGION_AU915)
      || (LmHandlerParams.ActiveRegion == LORAMAC_REGION_AS923))
  {
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
  }
  else
  {
    latitude = sensor_data.latitude;
    longitude = sensor_data.longitude;

    AppData.Buffer[i++] = GetBatteryLevel();        // 1 (very low) to 254 (fully charged)
    AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);
*/
	  // }

  AppData.BufferSize = i;
  // #endif /* CAYENNE_LPP */

  if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
  {
    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
  }
  else if (nextTxIn > 0)
  {
    APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
  }
  /* USER CODE BEGIN SendTxData_2 */

  /* USER CODE END SendTxData_2 */
}

static void OnTxTimerEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerEvent_1 */

  /* USER CODE END OnTxTimerEvent_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);

  /*Wait for next tx slot*/
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN OnTxTimerEvent_2 */

  /* USER CODE END OnTxTimerEvent_2 */
}

static void OnTxTimerLedEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerLedEvent_1 */

  /* USER CODE END OnTxTimerLedEvent_1 */
  LED_Off(LED_RED2);
  /* USER CODE BEGIN OnTxTimerLedEvent_2 */

  /* USER CODE END OnTxTimerLedEvent_2 */
}

static void OnRxTimerLedEvent(void *context)
{
  /* USER CODE BEGIN OnRxTimerLedEvent_1 */

  /* USER CODE END OnRxTimerLedEvent_1 */
  LED_Off(LED_BLUE) ;
  /* USER CODE BEGIN OnRxTimerLedEvent_2 */

  /* USER CODE END OnRxTimerLedEvent_2 */
}

static void OnJoinTimerLedEvent(void *context)
{
  /* USER CODE BEGIN OnJoinTimerLedEvent_1 */

  /* USER CODE END OnJoinTimerLedEvent_1 */
  LED_Toggle(LED_RED1) ;
  /* USER CODE BEGIN OnJoinTimerLedEvent_2 */

  /* USER CODE END OnJoinTimerLedEvent_2 */
}

static void OnTxData(LmHandlerTxParams_t *params)
{
  /* USER CODE BEGIN OnTxData_1 */

  /* USER CODE END OnTxData_1 */
  if ((params != NULL) && (params->IsMcpsConfirm != 0))
  {
    LED_On(LED_RED2) ;
   // LED_Off(LED_RED2);

    UTIL_TIMER_Start(&TxLedTimer);

    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Confirmation =============\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d | Channel:%d", params->UplinkCounter,
            params->AppData.Port, params->Datarate, params->TxPower,params->Channel);

    APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
    APP_LOG(TS_OFF, VLEVEL_M, " | c:");
    if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG)
    {
      APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n", (params->AckReceived != 0) ? "ACK" : "NACK");
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
    }
  }

  /* USER CODE BEGIN OnTxData_2 */

  /* USER CODE END OnTxData_2 */
}

